{
    "common": {
        "name": "worx",
        "version": "2.1.1",
        "news": {
            "2.1.1": {
                "en": "Change reconnection times",
                "de": "Änderung der Wiederverbindungszeiten"
            },
            "2.1.0": {
                "en": "Move Calendar setState to one Json and other fixes to prevent blocking because of too many sending requests",
                "de": "Verschieben des Calendar in eine Json und andere Verbesserung, um ein 24h Block zu verhindern, der passiert wenn zu viele Anfragen gesendet werden."
            },
            "2.0.3": {
                "en": "Add manual refresh. Fix empty status and firmware format. Reduce info logs.",
                "de": "Manueller Refresh hinzugefügt. Fix für leeren Status und firmware format. Info logs reduziert."
            },
            "2.0.2": {
                "en": "Fix MQTT connection for Kress, Landxcape and Ferrex",
                "de": "MQTT Verbindung für Kress, Landxcape und Ferrex gefixt."
            },
            "2.0.1": {
                "en": "Adapter rewritten. Added product info and activity log. rawMqtt values improved and compatible with Node v18. ",
                "de": "Adapter neu geschrieben. Passwort muss erneut eingegeben werden. Produktinfo und Aktivitätsprotokoll hinzugefügt. rawMqtt Werte verbessert und mit Node v18 kompatibel.",
                "ru": "Адаптер переписан. Добавлена информация о продукте и журнал активности. сырье Значения Mqtt улучшены и совместимы с Node v18.",
                "pt": "Adapter reescrito. Adicionada informação do produto e log de atividade. em bruto Valores Mqtt melhorados e compatíveis com Node v18.",
                "nl": "Adapter herschreven. Voegde product info en activiteitslogboek toe. Rauw Mqt waarden verbeterd en compatibel met Node V18.",
                "fr": "Adaptateur réécrit. Ajout de l'info produit et du journal d'activité. brut Les valeurs Mqtt sont améliorées et compatibles avec Node v18.",
                "it": "Adattatore riscritto. Aggiunto informazioni prodotto e registro attività. crudo Valori Mqtt migliorati e compatibili con Node v18.",
                "es": "Adaptador reescrito. Información del producto y registro de actividad. crudo Valores Mqtt mejorados y compatibles con Node v18.",
                "pl": "Adapter rewrite (ang.). Dodany info i log aktywności. surowy Wartości Mqtt poprawiły i kompatybilne z Node v18.",
                "zh-cn": "写道。 添加成泡沫和活动逻辑的产品。 原料 Mqt数值有所改善,符合Node v18。."
            },
            "1.7.0": {
                "en": "Login Fixed",
                "de": "Anmeldung gefixt",
                "ru": "Войти Fixed",
                "pt": "Login Fixo",
                "nl": "Login Fix",
                "fr": "Se connecter Fixe",
                "it": "Login Fisso",
                "es": "Conexión fija",
                "pl": "Login Fixed",
                "zh-cn": "C. 损失"
            }
        },
        "titleLang": {
            "en": "Worx",
            "de": "Worx",
            "ru": "Воркс",
            "pt": "Worx",
            "nl": "Worx",
            "fr": "Worx",
            "it": "Peggio",
            "es": "Worx",
            "pl": "Worx",
            "zh-cn": "沃克斯"
        },
        "desc": {
            "en": "Adapter for Worx, Kresss, Landxcape or Ferrex mower via cloud",
            "de": "Adapter für Worx, Kress, Landxcape oder Ferrex Mäher via Cloud",
            "ru": "Адаптер для Worx, Kresss, Landxcape или Ferrex mower через облако",
            "pt": "Adaptador para Worx, Kress, Landxcape ou Ferrex cortador via nuvem",
            "nl": "Vertaling:",
            "fr": "Adaptateur pour Worx, Kresss, Landxcape ou Ferrex par nuage",
            "it": "Adattatore per tosaerba Worx, Kress, Landxcape o Ferrex tramite cloud",
            "es": "Adaptador para Worx, Kress, Landxcape o Ferrex mower a través de la nube",
            "pl": "Adapter for Worx, Kress, Landxcape lub Ferrex mower poprzez chmury",
            "zh-cn": "Worx, Kress, Landxcap 或Ferrex模块wer"
        },
        "authors": ["TA2k <tombox2020@gmail.com>", "MeisterTR", "Lucky-ESA"],
        "keywords": ["mower", "Worx", "Kress", "Landxcape", "Ferrex"],
        "license": "MIT",
        "platform": "Javascript/Node.js",
        "main": "main.js",
        "icon": "worx.png",
        "enabled": true,
        "extIcon": "https://raw.githubusercontent.com/iobroker-community-adapters/ioBroker.worx/master/admin/worx.png",
        "readme": "https://github.com/iobroker-community-adapters/ioBroker.worx/blob/master/README.md",
        "loglevel": "info",
        "mode": "daemon",
        "type": "garden",
        "compact": true,
        "connectionType": "cloud",
        "dataSource": "push",
        "messages": [
            {
                "condition": {
                    "operand": "and",
                    "rules": ["oldVersion<2.0.0", "newVersion>=2.0.0"]
                },
                "title": {
                    "en": "Important notice!",
                    "de": "Wichtiger Hinweis!",
                    "ru": "Важное замечание!",
                    "pt": "Notícia importante!",
                    "nl": "Belangrijke mededeling!",
                    "fr": "Avis important!",
                    "it": "Avviso IMPORTANTE!",
                    "es": "Noticia importante!",
                    "pl": "Ważna uwaga!",
                    "zh-cn": "重要通知!"
                },
                "text": {
                    "en": "Since v2.0.0 the password is saved encrypted. Please reenter your password in the settings after update.\n The folder rawMqtt is restructured please adjust your scripts.",
                    "de": "Seit v2.0.0 wird das Passwort verschlüsselt gespeichert. Bitte geben Sie Ihr Passwort erneut in den Einstellungen nach dem Update ein.\n Der Ordner rawMqtt wurde umstrukturiert, bitte passen Sie Ihre Skripte an.",
                    "ru": "С v2.0.0 пароль сохранен зашифрован. Пожалуйста, повторите пароль в настройках после обновления.\n Перестроена папка rawMqtt, пожалуйста, скорректируйте ваши скрипты.",
                    "pt": "Desde v2.0.0 a senha é salva criptografada. Por favor, digite sua senha nas configurações após a atualização.\n A pasta rawMqtt é reestruturada, ajuste seus scripts.",
                    "nl": "Aangezien het wachtwoord versleuteld is. Steun uw wachtwoord in de setting na update. De folder RawMqtt is herstructureerd.",
                    "fr": "Depuis v2.0.0 le mot de passe est enregistré crypté. Veuillez entrer votre mot de passe dans les paramètres après la mise à jour.\n Le dossier rawMqtt est restructuré s'il vous plaît ajuster vos scripts.",
                    "it": "Dal v2.0.0 la password viene salvata crittografata. Si prega di reinserire la password nelle impostazioni dopo l'aggiornamento.\n La cartella rawMqtt è ristrutturata si prega di regolare gli script.",
                    "es": "Desde v2.0.0 la contraseña se guarda encriptada. Por favor vuelva a introducir su contraseña en la configuración después de la actualización.\n La carpeta rawMqtt es reestructurada por favor ajuste sus scripts.",
                    "pl": "Od wersji v2.0.0 zapisywane jest hasłem. Powracaj do wasze hasło w ustawieniach po aktualizacji. Scenarzysta surMqtt jest zrestrukturyzowany do poprawy swoich scenariuszy.",
                    "zh-cn": "自第2.0.0号密码被加密。 请更正在最新资料后在环境中的密码。 编审后,请调整你的文字。."
                },
                "buttons": ["agree", "cancel"]
            }
        ],
        "adminUI": {
            "config": "json"
        },
        "plugins": {
            "sentry": {
                "dsn": "https://ee01bcb677bf44cb847d1069bfda2736@sentry.iobroker.net/107"
            }
        },
        "dependencies": [
            {
                "js-controller": ">=3.3.22"
            }
        ],
        "globalDependencies": [
            {
                "admin": ">=5.1.13"
            }
        ]
    },
    "encryptedNative": ["password"],
    "protectedNative": ["password"],
    "native": {
        "mail": "",
        "password": "",
        "edgeCutDelay": 5000,
        "server": "worx",
        "meterMin": false
    },
    "objects": [],
    "instanceObjects": [
        {
            "_id": "info",
            "type": "channel",
            "common": {
                "name": "Information"
            },
            "native": {}
        },
        {
            "_id": "info.connection",
            "type": "state",
            "common": {
                "role": "indicator.connected",
                "name": "Device or service connected",
                "type": "boolean",
                "read": true,
                "write": false,
                "def": false
            },
            "native": {}
        }
    ]
}
